In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("stress.csv")

In [3]:
df

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
2     3         c  23.0                                1.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0
5     6         f   NaN                                1.0             0.0
6     7         g   NaN                                NaN             NaN
7     8       NaN   NaN                                1.0             1.0

In [4]:
df.head()

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
2     3         c  23.0                                1.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0

In [5]:
df.columns

Index(['s.no', 'name', 'age', 'traditional educational approches',
       'stress of exam'],
      dtype='object')

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df['age'].unique()

array([17., 23., 34., 45., nan])

In [8]:
#to know number  of uniques values are prsent in particular column
df.age.nunique()

4

In [9]:
df.dropna(axis=1)

   s.no
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8

In [10]:
df

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
2     3         c  23.0                                1.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0
5     6         f   NaN                                1.0             0.0
6     7         g   NaN                                NaN             NaN
7     8       NaN   NaN                                1.0             1.0

In [11]:
st='sathvika'
st=st.replace("sathvika",'hi')
st

'hi'

In [12]:
df.dropna(thresh=4)

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
2     3         c  23.0                                1.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0
5     6         f   NaN                                1.0             0.0

# Experiment 3

In [13]:
df['age'].fillna(value=100)

0     17.0
1     23.0
2     23.0
3     34.0
4     45.0
5    100.0
6    100.0
7    100.0
Name: age, dtype: float64

In [14]:
m=df['age'].mean()

In [15]:
df['age'].fillna(m)

0    17.0
1    23.0
2    23.0
3    34.0
4    45.0
5    28.4
6    28.4
7    28.4
Name: age, dtype: float64

In [16]:
mod=df['age'].mode()
mod

0    23.0
dtype: float64

In [17]:
df.age.fillna(23)

0    17.0
1    23.0
2    23.0
3    34.0
4    45.0
5    23.0
6    23.0
7    23.0
Name: age, dtype: float64

In [18]:
med=df['age'].median()
med

23.0

In [19]:
df['age'].fillna(med)

0    17.0
1    23.0
2    23.0
3    34.0
4    45.0
5    23.0
6    23.0
7    23.0
Name: age, dtype: float64

In [20]:
df.describe()

          s.no        age  traditional educational approches  stress of exam
count  8.00000   5.000000                           7.000000        7.000000
mean   4.50000  28.400000                           0.857143        0.714286
std    2.44949  11.126545                           0.377964        0.487950
min    1.00000  17.000000                           0.000000        0.000000
25%    2.75000  23.000000                           1.000000        0.500000
50%    4.50000  23.000000                           1.000000        1.000000
75%    6.25000  34.000000                           1.000000        1.000000
max    8.00000  45.000000                           1.000000        1.000000

In [21]:
df.drop(7)

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
2     3         c  23.0                                1.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0
5     6         f   NaN                                1.0             0.0
6     7         g   NaN                                NaN             NaN

In [22]:
df.drop([2,5],axis=0)

   s.no      name   age  traditional educational approches  stress of exam
0     1  sathvika  17.0                                1.0             1.0
1     2         b  23.0                                0.0             1.0
3     4         d  34.0                                1.0             1.0
4     5         e  45.0                                1.0             0.0
6     7         g   NaN                                NaN             NaN
7     8       NaN   NaN                                1.0             1.0